# Lab SQL queries 9

Instructions

Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

- How many distinct (different) actors' last names are there?
- Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
- Get all films with ARMAGEDDON in the title.
- Get 10 the longest films.
- How many films include Behind the Scenes content?
- Which kind of movies (rating) have a mean duration of more than two hours?
- Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [2]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass

In [3]:
password = getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

## 1. How many distinct (different) actors' last names are there?

In [19]:
actors = pd.read_sql_query('SELECT DISTINCT COUNT(last_name) FROM actor', engine)
actors

   COUNT(last_name)
0               200

## 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [20]:
daytype = pd.read_sql_query('''
SELECT *,
CASE 
WHEN WEEKDAY(rental_date) <5 THEN 'workday'
ELSE 'weekend'
END AS day_type
FROM rental;''', engine)
daytype

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday
...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,workday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,workday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,workday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,workday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,workday

## 3. Get all films with ARMAGEDDON in the title.

In [37]:
# It took me a while here to figure out what went wrong and how to fix it: 
# Python treats the % sign as a special character, which breaks the code if you keep it like it would be in straight up SQL
# And the 'classic' escape character \ (backslash) did not work.
# StackOverflow to the rescue: the escape character in this case is another %. So %% it is.

query1 = 'SELECT title FROM film WHERE title LIKE "%%Armageddon%%";'

armageddon = pd.read_sql_query(query1, engine)
armageddon.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

## 4. Get 10 the longest films.

In [21]:
actors = pd.read_sql_query('''SELECT title FROM film
ORDER BY length DESC
LIMIT 10;''', engine)
actors

                title
0      DARN FORRESTER
1        POND SEATTLE
2       CHICAGO NORTH
3       MUSCLE BRIGHT
4        WORST BANGER
5         GANGS PRIDE
6  SOLDIERS EVOLUTION
7           HOME PITY
8   SWEET BROTHERHOOD
9      CONTROL ANTHEM

## 5. How many films include Behind the Scenes content?

In [36]:
bts = pd.read_sql_query('''SELECT title, special_features FROM film
WHERE special_features LIKE '%%Behind the Scenes%%';''', engine)
bts

                title                           special_features
0    ACADEMY DINOSAUR           Deleted Scenes,Behind the Scenes
1    AFFAIR PREJUDICE             Commentaries,Behind the Scenes
2     ALAMO VIDEOTAPE             Commentaries,Behind the Scenes
3         ALI FOREVER           Deleted Scenes,Behind the Scenes
4      ALICE FANTASIA  Trailers,Deleted Scenes,Behind the Scenes
..                ...                                        ...
533      WORST BANGER           Deleted Scenes,Behind the Scenes
534    WRONG BEHAVIOR                 Trailers,Behind the Scenes
535    YOUNG LANGUAGE                 Trailers,Behind the Scenes
536        YOUTH KICK                 Trailers,Behind the Scenes
537         ZORRO ARK    Trailers,Commentaries,Behind the Scenes

[538 rows x 2 columns]

## 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [32]:
duration = pd.read_sql_query("SELECT DISTINCT rating FROM sakila.film WHERE length > 120;", engine)
rating

  rating
0      G
1     PG
2  NC-17
3      R
4  PG-13

## 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [34]:
rank = pd.read_sql_query ('''SELECT title, 
       length, 
       DENSE_RANK() OVER (ORDER BY length DESC) ranking FROM sakila.film
WHERE length IS NOT NULL
AND length > 0;''', engine)
rank

                   title  length  ranking
0          CHICAGO NORTH     185        1
1         CONTROL ANTHEM     185        1
2         DARN FORRESTER     185        1
3            GANGS PRIDE     185        1
4              HOME PITY     185        1
..                   ...     ...      ...
995         ALIEN CENTER      46      140
996            IRON MOON      46      140
997        KWAI HOMEWARD      46      140
998     LABYRINTH LEAGUE      46      140
999  RIDGEMONT SUBMARINE      46      140

[1000 rows x 3 columns]